# wsEditAddMenu

## Description
Add a menu under Tools -&gt; Thrid-party. Use dot as a delimiter for sub menus in 'commandName'.

```pascal
PROCEDURE wsEditAddMenu(menuPath : STRING);
```

```python
def vs.wsEditAddMenu(menuPath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|menuPath|STRING|   |

## Remarks
(MaKro) Had no success with dot as delimiter. Slash works fine.

## Version
Availability: from Vectorworks 2018

## Category
* Workspaces